In [7]:
#Logistic Regression with Titanic
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [8]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [10]:
df.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [11]:
df.isnull().sum() #normally if having more than 60% values null then drop it

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [12]:

df.describe() #it gives only numerical data

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [13]:
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [14]:
df['embark_town'].nunique()

3

In [15]:
df['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [16]:
df['embark_town'].value_counts() #it shows entities per category. This also skips missing or nan as well

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [17]:
df['age'].mean()

np.float64(29.69911764705882)

In [18]:
df['age'].median() #median gives central value from

28.0

In [19]:
df['age'] = df['age'].fillna(df['age'].median())

In [20]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [21]:
df['sex'].mode()[0]

'male'

In [22]:
df.shape[1]

15

In [23]:
df['sex'] = df['sex'].fillna(df['sex'].mode()[0])

In [24]:
df['deck'] = df['deck'].fillna(df['deck'].mode()[0])

In [25]:
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [26]:
df['embark_town'] = df['embark_town'].fillna(df['embark_town'].mode()[0])
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [27]:
df['embarked'] = df['embarked'].fillna(df['embarked'].mode()[0])
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [28]:
#three type of coding Label encoding is only used for output column, order encoding, onehot encoding
#drop first will cause the drop of one category and in its absence model will count it in its absence if other two are not count

In [31]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True

In [32]:
df = pd.get_dummies(df,drop_first=True)
df.head()

NameError: name 'pd' is not defined

In [33]:
#6th class
x = df.drop(columns=['survived','age','fare'])

In [34]:
y=df['survived']

In [35]:
x

,pclass,sex,sibsp,parch,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,3,male,1,0,S,Third,man,True,C,Southampton,no,False
1,1,female,1,0,C,First,woman,False,C,Cherbourg,yes,False
2,3,female,0,0,S,Third,woman,False,C,Southampton,yes,True
3,1,female,1,0,S,First,woman,False,C,Southampton,yes,False
4,3,male,0,0,S,Third,man,True,C,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...
886,2,male,0,0,S,Second,man,True,C,Southampton,no,True
887,1,female,0,0,S,First,woman,False,B,Southampton,yes,True
888,3,female,1,2,S,Third,woman,False,C,Southampton,no,False
889,1,male,0,0,C,First,man,True,C,Cherbourg,yes,True
890,3,male,0,0,Q,Third,man,True,C,Queenstown,no,True

In [36]:
#train test split
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.25,random_state=90)

In [37]:
x_train

,pclass,sex,sibsp,parch,embarked,class,who,adult_male,deck,embark_town,alive,alone
415,3,female,0,0,S,Third,woman,False,C,Southampton,no,True
652,3,male,0,0,S,Third,man,True,C,Southampton,no,True
204,3,male,0,0,S,Third,man,True,C,Southampton,yes,True
32,3,female,0,0,Q,Third,woman,False,C,Queenstown,yes,True
860,3,male,2,0,S,Third,man,True,C,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...
323,2,female,1,1,S,Second,woman,False,C,Southampton,yes,False
671,1,male,1,0,S,First,man,True,B,Southampton,no,False
626,2,male,0,0,Q,Second,man,True,C,Queenstown,no,True
669,1,female,1,0,S,First,woman,False,C,Southampton,yes,False
859,3,male,0,0,C,Third,man,True,C,Cherbourg,no,True